In [71]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
cast = pd.read_csv('imdb_pandas/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [6]:
release_dates = pd.read_csv('imdb_pandas/release_dates.csv', index_col=None,
                                       parse_dates=['date'], infer_datetime_format=True)
release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

### Count the number of movies with "Christmas" in their title for each month, that is released are the USA.

In [26]:
Chris_USA =release_dates[(release_dates['title'].str.contains('Christmas', regex = False) 
               & (release_dates['country']=='USA'))]
Chris_USA.groupby([Chris_USA['date'].dt.month]).count()['title']

date
1      2
2      2
4      1
5      1
6      1
7      1
8      2
9      2
10    14
11    38
12    47
Name: title, dtype: int64

### Count the number of movies with "Christmas" in their title for each month, that are released in Canada.

In [27]:
Chris_CAD =release_dates[(release_dates['title'].str.contains('Christmas', regex = False) 
               & (release_dates['country']=='Canada'))]
Chris_CAD.groupby([Chris_CAD['date'].dt.month]).count()['title']

date
10    2
11    9
12    6
Name: title, dtype: int64

### Count the number of movies in which the titles start with "The Hobbit" for each month, that are released in the USA.

In [18]:
release_dates[(release_dates['title'].str.startswith('The Hobbit') 
               & (release_dates['country']=='USA'))].count()['title']

3

In [29]:
Hob_USA =release_dates[(release_dates['title'].str.startswith('The Hobbit') 
               & (release_dates['country']=='USA'))]
Hob_USA.groupby([Hob_USA['date'].dt.month]).count()['title']

date
12    3
Name: title, dtype: int64

### Count the number of movies with "Romance" in their title for **each day of the week**, that are released in the USA.

In [48]:
release_dates['weekday'] = release_dates['date'].dt.weekday
release_dates
#Ro_USA.groupby(by=Ro_USA['date'].dt.date).count()

                          title  year      country       date  weekday
0         #73, Shaanthi Nivaasa  2007        India 2007-06-15        4
1                       #Beings  2015      Romania 2015-01-29        3
2                     #Declimax  2018  Netherlands 2018-01-21        6
3        #Ewankosau saranghaeyo  2015  Philippines 2015-01-21        2
4                       #Horror  2015          USA 2015-11-20        4
...                         ...   ...          ...        ...      ...
452651  xXx: State of the Union  2005          USA 2005-04-29        4
452652  xXx: State of the Union  2005       Poland 2005-06-03        4
452653  xXx: State of the Union  2005       Turkey 2005-06-03        4
452654  xXx: State of the Union  2005        China 2005-06-17        4
452655  xXx: State of the Union  2005       Greece 2005-06-24        4

[452656 rows x 5 columns]

In [55]:
Ro_USA =release_dates[(release_dates['title'].str.contains('Romance', regex =False) 
               & (release_dates['country']=='USA'))]
Ro_USA.groupby('weekday').count()['title']

weekday
0    21
1     4
2    11
3     6
4    18
5     8
6    32
Name: title, dtype: int64

### Count the number of movies with "Action" in their title for **each day of the week**, that are released in the USA.

In [56]:
Ac_USA =release_dates[(release_dates['title'].str.contains('Action', regex =False) 
               & (release_dates['country']=='USA'))]
Ac_USA.groupby('weekday').count()['title']

weekday
0     2
1     1
2     3
3     1
4    19
5     2
6     3
Name: title, dtype: int64

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [81]:
Judi = new[(new['name'] == 'Judi Dench') & (new['year'] >= 1990) & (new['year'] <= 1999)]
Judi.groupby(['year', 'date']).count()

                 title  name  type  character  n  country  weekday
year date
1995 1995-06-02      1     1     1          1  1        1        1
     1995-06-09      1     1     1          1  1        1        1
     1995-07-13      1     1     1          1  1        1        1
     1995-09-22      1     1     1          1  1        1        1
     1995-09-27      1     1     1          1  1        1        1
...                ...   ...   ...        ... ..      ...      ...
1999 2000-03-16      1     1     1          1  1        1        1
     2000-04-07      1     1     1          1  1        1        1
     2000-04-14      1     1     1          1  1        1        1
     2000-05-27      1     1     1          1  1        1        1
     2000-06-08      1     1     1          1  1        1        1

[156 rows x 7 columns]

### In which months do films with the actress Judi Dench tend to be released in the USA?

In [65]:
new = pd.merge(cast,release_dates)
new

,title,year,name,type,character,n,country,date,weekday
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,Taiwan,2016-05-27,4
1,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,Germany,2016-10-06,3
2,Closet Monster,2015,Aaron Abrams,actor,Peter Madly,3.0,Taiwan,2016-05-27,4
3,Closet Monster,2015,Aaron Abrams,actor,Peter Madly,3.0,Germany,2016-10-06,3
4,Closet Monster,2015,Chunk (III),actor,Buffy 1,NaN,Taiwan,2016-05-27,4
...,...,...,...,...,...,...,...,...,...
18504245,Gui ri zi,2014,Li Ziqian,actress,Pomegranate,NaN,France,2016-03-30,2
18504246,Los pulpos,1948,Olga Zubarry,actress,Myrtha,1.0,Argentina,1948-03-17,2
18504247,Sana'y laging magkapiling,1994,Dawn Zulueta,actress,Maria Makiling,1.0,Philippines,1994-08-17,2
18504248,The Cecilia Masagca Story: Antipolo Massacre (...,1994,Dawn Zulueta,actress,Cecilia Masagca,1.0,Philippines,1994-04-09,5
18504249,Familia tortuga,2006,Manuela ?maz,actress,Aunt,NaN,Mexico,2008-10-31,4

In [66]:
Judi_month =new[(new['name'] == 'Judi Dench')
               & (new['country']=='USA')]
Judi_month.groupby([Judi_month['date'].dt.month]).count()['title']

date
1      4
2      4
3      3
4      2
5      4
6      3
7      1
8      1
9      2
10     1
11    12
12     4
Name: title, dtype: int64

### In which months do films with the actor Tom Cruise tend to be released in the USA?

In [67]:
Judi_month =new[(new['name'] == 'Tom Cruise')
               & (new['country']=='USA')]
Judi_month.groupby([Judi_month['date'].dt.month]).count()['title']

date
1      2
3      1
4      3
5      5
6      8
7      7
8      3
9      1
10     3
11     3
12    10
Name: title, dtype: int64